IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_output_xbar_ext64_regs.xml
	<register id="OUTPUT6MUX32TO47CFG" width="32" page="1" offset="0x2c" internal="0" description="Output X-BAR Mux Configuration for Output 6">
		<bitfield id="MUX32" description="MUX32 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX33" description="MUX33 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX34" description="MUX34 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX35" description="MUX35 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX36" description="MUX36 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX37" description="MUX37 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX38" description="MUX38 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX39" description="MUX39 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX40" description="MUX40 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX41" description="MUX41 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX42" description="MUX42 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX43" description="MUX43 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX44" description="MUX44 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX45" description="MUX45 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX46" description="MUX46 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX47" description="MUX47 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT6MUX48TO63CFG" width="32" page="1" offset="0x2e" internal="0" description="Output X-BAR Mux Configuration for Output 6">
		<bitfield id="MUX48" description="MUX48 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX49" description="MUX49 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX50" description="MUX50 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX51" description="MUX51 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX52" description="MUX52 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX53" description="MUX53 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX54" description="MUX54 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX55" description="MUX55 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX56" description="MUX56 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX57" description="MUX57 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX58" description="MUX58 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX59" description="MUX59 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX60" description="MUX60 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX61" description="MUX61 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX62" description="MUX62 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX63" description="MUX63 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT7MUX0TO15CFG" width="32" page="1" offset="0x30" internal="0" description="Output X-BAR Mux Configuration for Output 7">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT7MUX16TO31CFG" width="32" page="1" offset="0x32" internal="0" description="Output X-BAR Mux Configuration for Output 7">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT7MUX32TO47CFG" width="32" page="1" offset="0x34" internal="0" description="Output X-BAR Mux Configuration for Output 7">
		<bitfield id="MUX32" description="MUX32 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX33" description="MUX33 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX34" description="MUX34 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX35" description="MUX35 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX36" description="MUX36 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX37" description="MUX37 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX38" description="MUX38 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX39" description="MUX39 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX40" description="MUX40 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX41" description="MUX41 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX42" description="MUX42 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX43" description="MUX43 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX44" description="MUX44 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX45" description="MUX45 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX46" description="MUX46 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX47" description="MUX47 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT7MUX48TO63CFG" width="32" page="1" offset="0x36" internal="0" description="Output X-BAR Mux Configuration for Output 7">
		<bitfield id="MUX48" description="MUX48 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX49" description="MUX49 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX50" description="MUX50 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX51" description="MUX51 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX52" description="MUX52 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX53" description="MUX53 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX54" description="MUX54 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX55" description="MUX55 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX56" description="MUX56 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX57" description="MUX57 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX58" description="MUX58 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX59" description="MUX59 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX60" description="MUX60 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX61" description="MUX61 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX62" description="MUX62 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX63" description="MUX63 Configuration for OUTPUT7 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT8MUX0TO15CFG" width="32" page="1" offset="0x38" internal="0" description="Output X-BAR Mux Configuration for Output 8">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT8 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
